{
  "plugins": {
    "LuaSnip": {
      "src": "https://github.com/L3MON4D3/LuaSnip",
      "version": "'a62e1083a3cfe8b6b206e7d3d33a51091df25357'"
    },
    "avante.nvim": {
      "src": "https://github.com/yetone/avante.nvim",
      "version": "'8c84af0f09e5d9058362ac58401a8e7b047d826e'"
    },
    "catppuccin": {
      "src": "https://github.com/catppuccin/nvim",
      "version": "'426dbebe06b5c69fd846ceb17b42e12f890aedf1'"
    },
    "cmp-buffer": {
      "src": "https://github.com/hrsh7th/cmp-buffer",
      "version": "'b74fab3656eea9de20a9b8116afa3cfc4ec09657'"
    },
    "cmp-nvim-lsp": {
      "src": "https://github.com/hrsh7th/cmp-nvim-lsp",
      "version": "'cbc7b02bb99fae35cb42f514762b89b5126651ef'"
    },
    "cmp-path": {
      "src": "https://github.com/hrsh7th/cmp-path",
      "version": "'c642487086dbd9a93160e1679a1327be111cbc25'"
    },
    "cmp_luasnip": {
      "src": "https://github.com/saadparwaiz1/cmp_luasnip",
      "version": "'98d9cb5c2c38532bd9bdb481067b20fea8f32e90'"
    },
    "conform.nvim": {
      "src": "https://github.com/stevearc/conform.nvim",
      "version": "'086a40dc7ed8242c03be9f47fbcee68699cc2395'"
    },
    "copilot.lua": {
      "src": "https://github.com/zbirenbaum/copilot.lua",
      "version": "'07aa57148ac28986bab9f55e87ee3d929e2726b1'"
    },
    "diffview.nvim": {
      "src": "https://github.com/sindrets/diffview.nvim",
      "version": "'4516612fe98ff56ae0415a259ff6361a89419b0a'"
    },
    "dressing.nvim": {
      "src": "https://github.com/stevearc/dressing.nvim",
      "version": "'2d7c2db2507fa3c4956142ee607431ddb2828639'"
    },
    "emmet-vim": {
      "src": "https://github.com/mattn/emmet-vim",
      "version": "'92ef2f74f4093edc99db5e9e4cf7e40116a85bd6'"
    },
    "friendly-snippets": {
      "src": "https://github.com/rafamadriz/friendly-snippets",
      "version": "'6cd7280adead7f586db6fccbd15d2cac7e2188b9'"
    },
    "fzf": {
      "src": "https://github.com/junegunn/fzf",
      "version": "'18315000185a6e6461b9b4aa4a4cb6cd164e0e35'"
    },
    "fzf-lua": {
      "src": "https://github.com/ibhagwan/fzf-lua",
      "version": "'9f0432fdd7825ab163520045831a40b6df82ea28'"
    },
    "git-conflict.nvim": {
      "src": "https://github.com/akinsho/git-conflict.nvim",
      "version": "'4bbfdd92d547d2862a75b4e80afaf30e73f7bbb4'"
    },
    "gitsigns.nvim": {
      "src": "https://github.com/lewis6991/gitsigns.nvim",
      "version": "'0d797daee85366bc242580e352a4f62d67557b84'"
    },
    "img-clip.nvim": {
      "src": "https://github.com/HakonHarnes/img-clip.nvim",
      "version": "'b6ddfb97b5600d99afe3452d707444afda658aca'"
    },
    "indent-blankline.nvim": {
      "src": "https://github.com/lukas-reineke/indent-blankline.nvim",
      "version": "'d28a3f70721c79e3c5f6693057ae929f3d9c0a03'"
    },
    "lualine.nvim": {
      "src": "https://github.com/nvim-lualine/lualine.nvim",
      "version": "'8811f3f3f4dc09d740c67e9ce399e7a541e2e5b2'"
    },
    "mason-lspconfig.nvim": {
      "src": "https://github.com/williamboman/mason-lspconfig.nvim",
      "version": "'25f609e7fca78af7cede4f9fa3af8a94b1c4950b'"
    },
    "mason-tool-installer.nvim": {
      "src": "https://github.com/WhoIsSethDaniel/mason-tool-installer.nvim",
      "version": "'443f1ef8b5e6bf47045cb2217b6f748a223cf7dc'"
    },
    "mason.nvim": {
      "src": "https://github.com/williamboman/mason.nvim",
      "version": "'b03fb0f20bc1d43daf558cda981a2be22e73ac42'"
    },
    "mini.comment": {
      "src": "https://github.com/echasnovski/mini.comment",
      "version": "'8e5ff3ed3cc0e8f216617aae01020c00c20f7a87'"
    },
    "mini.files": {
      "src": "https://github.com/echasnovski/mini.files",
      "version": "'ced297546b8fdb8e215d416d4753a735514a2fe0'"
    },
    "mini.icons": {
      "src": "https://github.com/echasnovski/mini.icons",
      "version": "'7fdae2443a0e2910015ca39ad74b50524ee682d3'"
    },
    "mini.pick": {
      "src": "https://github.com/echasnovski/mini.pick",
      "version": "'fd7e7efadddcec3f3d7f3b363a99aa44e7286c65'"
    },
    "neo-tree.nvim": {
      "src": "https://github.com/nvim-neo-tree/neo-tree.nvim",
      "version": "'84c75e7a7e443586f60508d12fc50f90d9aee14e'"
    },
    "neogit": {
      "src": "https://github.com/NeogitOrg/neogit",
      "version": "'5a7fca171e3ad07380745d573d791e95268b8f3f'"
    },
    "none-ls-extras.nvim": {
      "src": "https://github.com/nvimtools/none-ls-extras.nvim",
      "version": "'14fa31ce8c0268a3b2c9cc14979ecf771982d433'"
    },
    "none-ls.nvim": {
      "src": "https://github.com/nvimtools/none-ls.nvim",
      "version": "'7f9301e416533b5d74e2fb3b1ce5059eeaed748b'"
    },
    "nui.nvim": {
      "src": "https://github.com/MunifTanjim/nui.nvim",
      "version": "'de740991c12411b663994b2860f1a4fd0937c130'"
    },
    "nvim-autopairs": {
      "src": "https://github.com/windwp/nvim-autopairs",
      "version": "'59bce2eef357189c3305e25bc6dd2d138c1683f5'"
    },
    "nvim-bqf": {
      "src": "https://github.com/kevinhwang91/nvim-bqf",
      "version": "'c282a62bec6c0621a1ef5132aa3f4c9fc4dcc2c7'"
    },
    "nvim-cmp": {
      "src": "https://github.com/hrsh7th/nvim-cmp",
      "version": "'a1d504892f2bc56c2e79b65c6faded2fd21f3eca'"
    },
    "nvim-colorizer.lua": {
      "src": "https://github.com/norcalli/nvim-colorizer.lua",
      "version": "'a065833f35a3a7cc3ef137ac88b5381da2ba302e'"
    },
    "nvim-lint": {
      "src": "https://github.com/mfussenegger/nvim-lint",
      "version": "'4b03656c09c1561f89b6aa0665c15d292ba9499d'"
    },
    "nvim-lspconfig": {
      "src": "https://github.com/neovim/nvim-lspconfig",
      "version": "'bedca8b426b2fee0ccac596d167d71bbe971253f'"
    },
    "nvim-surround": {
      "src": "https://github.com/kylechui/nvim-surround",
      "version": "'1098d7b3c34adcfa7feb3289ee434529abd4afd1'"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter",
      "version": "'cf12346a3414fa1b06af75c79faebe7f76df080a'"
    },
    "nvim-treesitter-context": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter-context",
      "version": "'b0c45cefe2c8f7b55fc46f34e563bc428ef99636'"
    },
    "nvim-treesitter-textobjects": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter-textobjects",
      "version": "'5ca4aaa6efdcc59be46b95a3e876300cfead05ef'"
    },
    "nvim-ts-autotag": {
      "src": "https://github.com/windwp/nvim-ts-autotag",
      "version": "'8e1c0a389f20bf7f5b0dd0e00306c1247bda2595'"
    },
    "nvim-web-devicons": {
      "src": "https://github.com/nvim-tree/nvim-web-devicons",
      "version": "'95b7a002d5dba1a42eb58f5fac5c565a485eefd0'"
    },
    "oil.nvim": {
      "src": "https://github.com/stevearc/oil.nvim",
      "version": "'0fcc83805ad11cf714a949c98c605ed717e0b83e'"
    },
    "opencode.nvim": {
      "src": "https://github.com/NickvanDyke/opencode.nvim",
      "version": "'fa0a495fa2c229115404cb3c1970578f9c6d2f76'"
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim",
      "version": "'b9fd5226c2f76c951fc8ed5923d85e4de065e509'"
    },
    "rainbow-delimiters.nvim": {
      "src": "https://github.com/HiPhish/rainbow-delimiters.nvim",
      "version": "'aab6caaffd79b8def22ec4320a5344f7c42f58d2'"
    },
    "render-markdown.nvim": {
      "src": "https://github.com/MeanderingProgrammer/render-markdown.nvim",
      "version": "'4ae2f2e8e8c66d070f33cfb57cb6f867e3baf5d9'"
    },
    "snacks.nvim": {
      "src": "https://github.com/folke/snacks.nvim",
      "version": "'ad9ede6a9cddf16cedbd31b8932d6dcdee9b716e'"
    },
    "sqlite.lua": {
      "src": "https://github.com/kkharji/sqlite.lua",
      "version": "'50092d60feb242602d7578398c6eb53b4a8ffe7b'"
    },
    "telescope-ui-select.nvim": {
      "src": "https://github.com/nvim-telescope/telescope-ui-select.nvim",
      "version": "'6e51d7da30bd139a6950adf2a47fda6df9fa06d2'"
    },
    "telescope.nvim": {
      "src": "https://github.com/nvim-telescope/telescope.nvim",
      "version": "'a0bbec21143c7bc5f8bb02e0005fa0b982edc026'"
    },
    "trouble.nvim": {
      "src": "https://github.com/folke/trouble.nvim",
      "version": "'bd67efe408d4816e25e8491cc5ad4088e708a69a'"
    },
    "vim-illuminate": {
      "src": "https://github.com/RRethy/vim-illuminate",
      "version": "'0d1e93684da00ab7c057410fecfc24f434698898'"
    },
    "vim-tmux-navigator": {
      "src": "https://github.com/christoomey/vim-tmux-navigator",
      "version": "'e41c431a0c7b7388ae7ba341f01a0d217eb3a432'"
    },
    "which-key.nvim": {
      "src": "https://github.com/folke/which-key.nvim",
      "version": "'3aab2147e74890957785941f0c1ad87d0a44c15a'"
    }
  }
}
